#### Project 1
Maddy Bursell, Kim McKeever

In [1]:
#Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In this project, we will be reading in files that use 2010 US census data. The goal will be to first read in the data and parse it into a format we can use. Then we will write some functions to pull in a later data set. {Probably do more things too, this is a brief introduction}

First, we read in the initial census data to examine:

In [2]:
import_data = pd.read_csv("EDU01a.csv")
import_data.head()

,Area_name,STCOU,EDU010187F,EDU010187D,EDU010187N1,EDU010187N2,EDU010188F,EDU010188D,EDU010188N1,EDU010188N2,...,EDU010194N1,EDU010194N2,EDU010195F,EDU010195D,EDU010195N1,EDU010195N2,EDU010196F,EDU010196D,EDU010196N1,EDU010196N2
0,UNITED STATES,0,0,40024299,0,0,0,39967624,0,0,...,0,0,0,43993459,0,0,0,44715737,0,0
1,ALABAMA,1000,0,733735,0,0,0,728234,0,0,...,0,0,0,727989,0,0,0,736825,0,0
2,"Autauga, AL",1001,0,6829,0,0,0,6900,0,0,...,0,0,0,7568,0,0,0,7834,0,0
3,"Baldwin, AL",1003,0,16417,0,0,0,16465,0,0,...,0,0,0,19961,0,0,0,20699,0,0
4,"Barbour, AL",1005,0,5071,0,0,0,5098,0,0,...,0,0,0,5017,0,0,0,5053,0,0

We only want to maintain a few columns with specific parameters: we want 'Area_name', 'STCOU', and any column that ends with the letter 'D'. Since we want to select all columns ending in "D", we are locating those names first:

In [3]:
cols=list(import_data)
col_names=[]
for x in cols:
    if x.endswith("D"):
        col_names.append(x)
    else:
        continue

Creating a list of desired columns for our modified data frame by using specific coumn names from the import data and by unpacking the list of column names that end with "D" that was generated in the previous line.

In [4]:
col_list=['Area_name', 'STCOU', *col_names]

Now, using the `.loc()` method and the desired columns found in 'col_list', a new dataframe is generated. A preview of this dataframe can be seen by calling `census_df.head()`

In [5]:
 census_df=import_data.loc[:,col_list]
 census_df.head()

,Area_name,STCOU,EDU010187D,EDU010188D,EDU010189D,EDU010190D,EDU010191D,EDU010192D,EDU010193D,EDU010194D,EDU010195D,EDU010196D
0,UNITED STATES,0,40024299,39967624,40317775,40737600,41385442,42088151,42724710,43369917,43993459,44715737
1,ALABAMA,1000,733735,728234,730048,728252,725541,726150,728014,730509,727989,736825
2,"Autauga, AL",1001,6829,6900,6920,6847,7008,7137,7152,7381,7568,7834
3,"Baldwin, AL",1003,16417,16465,16799,17054,17479,17983,18735,19384,19961,20699
4,"Barbour, AL",1005,5071,5098,5068,5156,5173,5252,5135,5111,5017,5053